import numpy
from sklearn import preprocessing

#Исходные необработанные данные
raw_data = numpy.array((
    #класс 1
    (29.835, 5.61), (34.425, 11.22), (46.155, 6.375), (31.365, 9.69), (43.095, 3.57),
    #класс 2
    (51, 21.42), (64.26, 15.56), (60.95, 18.87), (55.59, 23.46), (69.87, 21.68),
    #класс 3
    (101.75, 5.61), (90.27, 11.22), (77.775, 6.375), (83.64, 9.69), (97.665, 3.57),
    #класс 4
    (101.75, 29.58), (90.27, 37.23), (77.775, 27.54), (83.64, 31.62), (97.665, 30.09)
))

#Исходные обработанные данные
data = preprocessing.MinMaxScaler().fit_transform(raw_data)